logs/Oct16/等待时间与请求频次/lambda10/1.txt
wrk debian/4.1.0-3build1 [epoll] Copyright (C) 2012 Will Glozer
Running 10m test @ http://172.18.0.4:32329
  16 threads and 16 connections
3 3.443115234375 49.590087890625 49.590087890625 0
2 2.62158203125 11.485595703125 11.485595703125 40
15 3.684326171875 208.535888671875 208.535888671875 350
40 3.04931640625 517.1474609375 517.1474609375 0
25 3.015869140625 372.976806640625 372.976806640625 0
100 3.115478515625 1909.064697265625 1909.064697265625 150
150 5.17529296875 2614.889404296875 2614.889404296875 0
250 4.928466796875 4510.75341796875 4510.75341796875 0
200 2.4755859375 3368.747802734375 3368.747802734375 0
350 3.581787109375 6110.781494140625 6110.781494140625 8000
350 3.341064453125 6110.282958984375 6110.282958984375 0
350 2.792724609375 6302.250732421875 6302.250732421875 500
5 3.31298828125 173.481201171875 174.481201171875 0
5 3.306396484375 107.693603515625 107.693603515625 0
15 2.375244140625 244.1943359375 244.1943359375 0
350 2.89697265625 6494.73876953125 6494.73876953125 0
1 3.36279296875 83.012451171875 83.012451171875 0
250 2.9150390625 4566.069091796875 4566.069091796875 0
150 3.140869140625 2671.669677734375 2671.669677734375 0
1 5.09716796875 80.218017578125 80.218017578125 0
40 4.6025390625 597.938232421875 597.938232421875 0
1 2.652587890625 47.930419921875 47.930419921875 0
500 2.81640625 8607.743896484375 8607.743896484375 8000
500 2.713134765625 8705.191162109375 8705.191162109375 0
500 3.57275390625 8802.855224609375 8802.855224609375 0
30 3.77001953125 676.7509765625 676.7509765625 0
40 3.7021484375 683.221435546875 684.221435546875 0
250 3.365478515625 4071.42626953125 4072.42626953125 500
100 1.911865234375 1574.028076171875 1574.028076171875 0
30 4.09912109375 591.4091796875 591.4091796875 0
200 3.156005859375 3704.078857421875 3704.078857421875 0
500 3.20068359375 8476.994140625 8476.994140625 0
500 3.244873046875 8385.805419921875 8385.805419921875 0
15 3.449951171875 553.632080078125 553.632080078125 0
1000 3.125 17306.755126953125 17306.755126953125 0
700 3.84130859375 12067.341796875 12067.341796875 0
2 2.322265625 194.8994140625 194.8994140625 0
700 4.565185546875 13278.7099609375 13278.7099609375 0
1000 3.982177734375 17310.71240234375 17310.71240234375 0
500 3.1875 8541.985595703125 8541.985595703125 0
500 2.90673828125 8379.420654296875 8379.420654296875 0
30 3.17919921875 477.307373046875 477.307373046875 0
5 2.99755859375 59.625 59.625 0
500 5.111083984375 8265.71630859375 8265.71630859375 0
15 3.107666015625 599.025390625 599.025390625 0
3 3.3818359375 55.380615234375 55.380615234375 0
250 3.13037109375 4181.386962890625 4181.386962890625 0
1000 3.070068359375 16862.34228515625 16862.34228515625 0
100 2.48828125 1386.654541015625 1386.654541015625 0
500 2.733154296875 7788.203125 7788.203125 0
1 2.75341796875 43.458740234375 43.458740234375 0
700 2.9296875 11052.16796875 11052.16796875 0
250 2.80224609375 3944.727294921875 3944.727294921875 0
2000 3.381591796875 33273.20263671875 33273.20263671875 0
2000 2.742919921875 33264.67041015625 33264.67041015625 0
1 2.679443359375 98.789794921875 98.789794921875 0
100 3.40771484375 1662.149658203125 1662.149658203125 0
40 2.613525390625 557.46728515625 557.46728515625 0
1 3.1484375 73.296630859375 73.296630859375 0
50 3.793701171875 588.165283203125 588.165283203125 0
150 5.93994140625 2395.341552734375 2395.341552734375 0
30 3.915283203125 650.482666015625 650.482666015625 0
100 5.560302734375 1639.42626953125 1639.42626953125 0
200 3.611572265625 2734.498046875 2735.498046875 0
1 2.9443359375 54.94384765625 54.94384765625 0
350 2.868896484375 5082.49560546875 5082.49560546875 0
25 5.618408203125 310.63134765625 310.63134765625 0
1000 3.908203125 15037.690673828125 15037.690673828125 0
40 2.97900390625 572.3212890625 572.3212890625 0
15 3.034912109375 190.920654296875 190.920654296875 0
40 3.0849609375 566.448974609375 566.448974609375 0
2000 3.004150390625 31953.392333984375 31953.392333984375 0
250 2.69970703125 3383.353515625 3383.353515625 0
200 3.258544921875 2939.604736328125 2939.604736328125 0
2 3.478759765625 98.687255859375 99.687255859375 0
1000 4.69873046875 15444.410400390625 15444.410400390625 0
30 3.40087890625 874.7412109375 874.7412109375 0
150 3.22509765625 2370.540283203125 2370.540283203125 0
2000 3.072021484375 31651.9716796875 31651.9716796875 0
15 2.989013671875 162.156982421875 162.156982421875 0
250 5.4306640625 3579.1845703125 3579.1845703125 0
150 2.88037109375 1982.55810546875 1982.55810546875 0
200 2.61572265625 3043.616943359375 3043.616943359375 0
3 3.91943359375 99.49365234375 99.49365234375 0
50 3.972412109375 821.2197265625 821.2197265625 0
25 2.822021484375 378.65478515625 378.65478515625 0
200 3.00537109375 2880.431640625 2880.431640625 0
250 2.7861328125 3882.1533203125 3882.1533203125 0
30 2.62890625 350.23779296875 350.23779296875 0
100 2.486083984375 1678.536865234375 1678.536865234375 0
200 3.15869140625 2786.095947265625 2786.095947265625 0
50 5.312255859375 817.421142578125 817.421142578125 0
100 2.55224609375 1444.44775390625 1444.44775390625 0
250 2.816162109375 3448.08544921875 3448.08544921875 0
700 3.162109375 9845.239990234375 9845.239990234375 0
200 2.5458984375 2856.18701171875 2856.18701171875 0
2 3.665771484375 39.203369140625 39.203369140625 0
700 2.70751953125 9865.299072265625 9865.299072265625 0
2000 3.3896484375 28772.68212890625 28772.68212890625 0
100 2.57275390625 1398.147216796875 1398.147216796875 0
500 3.221435546875 6773.05126953125 6773.05126953125 0
3 3.454833984375 67.497314453125 67.497314453125 0
2000 2.973876953125 28970.043701171875 28970.043701171875 0
250 3.103759765625 3731.078125 3731.078125 0
100 3.46533203125 1681.243896484375 1681.243896484375 0
200 2.521240234375 2769.279052734375 2769.279052734375 0
3 4.89306640625 25.9892578125 25.9892578125 0
200 4.209716796875 2983.411376953125 2983.411376953125 0
15 2.322265625 275.712646484375 275.712646484375 0
150 2.703857421875 2147.66162109375 2147.66162109375 0
2 2.51171875 117.864990234375 117.864990234375 0
3 3.236328125 63.65185546875 63.65185546875 0
350 3.23828125 4870.34375 4870.34375 0
3 3.289794921875 71.958740234375 71.958740234375 0
500 3.543212890625 6855.833740234375 6856.833740234375 0
25 4.56396484375 223.638427734375 223.638427734375 0
5 5.616943359375 56.88623046875 56.88623046875 0
30 2.70947265625 340.182373046875 340.182373046875 0
50 2.572509765625 535.246826171875 535.246826171875 0
25 3.43359375 722.519287109375 722.519287109375 0
2000 2.908203125 28268.594970703125 28268.594970703125 0
500 2.44677734375 6930.19921875 6930.19921875 0
2 3.1650390625 80.802001953125 80.802001953125 0
30 2.23046875 304.61767578125 304.61767578125 0
15 3.2685546875 200.154052734375 200.154052734375 0
4000 3.632080078125 60140.73876953125 60141.73876953125 0
100 2.782470703125 1466.500244140625 1466.500244140625 0
150 3.20751953125 2134.727294921875 2134.727294921875 0
30 3.0341796875 394.822021484375 394.822021484375 0
1000 2.6455078125 12635.45263671875 12635.45263671875 0
15 3.0205078125 263.408203125 263.408203125 0
5 2.435546875 106.898193359375 106.898193359375 0
1000 3.19580078125 12679.9658203125 12679.9658203125 0
700 3.047119140625 8591.42724609375 8591.42724609375 0
2000 2.522216796875 26084.476806640625 26084.476806640625 0
2000 3.3427734375 25818.5751953125 25818.5751953125 0
1 3.126708984375 66.753662109375 66.753662109375 0
15 4.789306640625 151.32958984375 152.32958984375 0
350 2.7666015625 4482.098876953125 4482.098876953125 0
500 2.69482421875 6431.818359375 6431.818359375 0
40 4.677978515625 419.8857421875 419.8857421875 0
15 3.053955078125 357.940185546875 357.940185546875 0
50 3.1123046875 672.083984375 672.083984375 0
350 2.6611328125 4350.434326171875 4350.434326171875 0
150 4.292236328125 1928.599365234375 1928.599365234375 0
25 3.0859375 268.453125 268.453125 0
50 2.68408203125 424.595703125 424.595703125 0
2 2.84033203125 55.25244140625 55.25244140625 0
1 5.69775390625 46.017578125 46.017578125 0
700 2.6328125 8480.056640625 8480.056640625 0
50 2.6474609375 518.714599609375 518.714599609375 0
5 2.85888671875 181.91162109375 181.91162109375 0
25 2.556396484375 429.072998046875 429.072998046875 0
1 3.203125 201.84130859375 201.84130859375 0
15 2.927490234375 272.24755859375 272.24755859375 0
2 2.666748046875 64.7998046875 64.7998046875 0
2 3.063720703125 32.79052734375 32.79052734375 0
700 2.923095703125 8186.35107421875 8186.35107421875 0
250 2.806396484375 2827.8271484375 2827.8271484375 0
250 2.596435546875 2728.171875 2728.171875 0
500 8.946044921875 5642.04150390625 5642.04150390625 0
150 3.251708984375 1725.87841796875 1725.87841796875 0
100 3.12158203125 968.305419921875 968.305419921875 0
350 2.928955078125 4190.6875 4190.6875 0
4000 3.733642578125 51344.142333984375 51344.142333984375 0
700 3.283935546875 7953.87353515625 7953.87353515625 0
40 4.52294921875 643.145751953125 643.145751953125 0
3 3.029541015625 120.986572265625 120.986572265625 0
100 3.110595703125 1495.167724609375 1495.167724609375 0
50 3.44482421875 578.9365234375 578.9365234375 0
30 4.716064453125 382.47119140625 382.47119140625 0
1 4.1494140625 78.7470703125 78.7470703125 0
1000 2.48974609375 11686.8955078125 11686.8955078125 0
2 3.304443359375 58.69677734375 58.69677734375 0
4000 3.0673828125 50220.7236328125 50220.7236328125 0
350 2.900146484375 4026.735107421875 4026.735107421875 0
40 3.345947265625 361.496337890625 361.496337890625 0
1000 2.501953125 11082.4462890625 11082.4462890625 0
1 3.099365234375 74.761474609375 74.761474609375 0
8000 5.509765625 109714.07470703125 109714.07470703125 0
700 2.430908203125 7712.841796875 7712.841796875 0
50 2.796142578125 426.536865234375 426.536865234375 0
5 3.107666015625 32.76611328125 32.76611328125 0
25 6.738037109375 473.2373046875 473.2373046875 0
8000 6.38525390625 111698.658203125 111698.658203125 0
250 3.964599609375 3130.74853515625 3130.74853515625 0
8000 2.33837890625 112106.57080078125 112106.57080078125 0
2 2.980224609375 64.9345703125 64.9345703125 0
700 2.232666015625 7857.375 7857.375 0
4000 4.69091796875 48446.691650390625 48446.691650390625 0
250 2.889892578125 2704.822509765625 2704.822509765625 0
350 2.743896484375 3874.264892578125 3874.264892578125 0
30 3.007080078125 271.751220703125 271.751220703125 0
350 3.2265625 3957.782470703125 3957.782470703125 0
100 5.6572265625 1378.577880859375 1378.577880859375 0
350 2.826171875 4259.663818359375 4259.663818359375 0
350 3.11328125 4301.21142578125 4301.21142578125 0
100 2.463623046875 940.32861328125 940.32861328125 0
8000 3.832763671875 107790.34448242188 107790.34448242188 0
500 2.934326171875 5618.995849609375 5618.995849609375 0
1 2.6376953125 48.669189453125 48.669189453125 0
200 2.949462890625 2445.257568359375 2445.257568359375 0
500 2.888916015625 5960.322998046875 5960.322998046875 0
2000 2.38525390625 23296.439208984375 23296.439208984375 0
2 3.193603515625 77.644775390625 77.644775390625 0
50 3.039306640625 712.351318359375 712.351318359375 0
25 3.2314453125 297.417724609375 297.417724609375 0
8000 2.337646484375 102064.14575195312 102064.14575195312 0
1 3.800537109375 23.6630859375 23.6630859375 0
2 6.2890625 99.264892578125 99.264892578125 0
5 2.823486328125 82.463134765625 82.463134765625 0
3 2.392822265625 81.1298828125 81.1298828125 0
30 3.428466796875 320.927001953125 320.927001953125 0
2000 3.105712890625 23064.95556640625 23064.95556640625 0
700 3.218505859375 7983.303466796875 7984.303466796875 0
25 2.834716796875 272.82861328125 272.82861328125 0
2 3.196533203125 67.368408203125 67.368408203125 0
5 4.42822265625 84.129150390625 85.129150390625 0
5 2.66552734375 137.759033203125 137.759033203125 0
3 2.625 60.04443359375 60.04443359375 0
1 3.08447265625 32.178466796875 32.178466796875 0
15 4.717041015625 407.259521484375 407.259521484375 0
1 4.9443359375 76.656494140625 76.656494140625 0
15 3.209228515625 179.911865234375 179.911865234375 0
2000 3.6650390625 23448.59912109375 23448.59912109375 0
5 3.040771484375 87.072265625 87.072265625 0
250 3.453125 2795.028076171875 2795.028076171875 0
25 3.4580078125 476.29833984375 476.29833984375 0
8000 2.8671875 99183.21020507812 99183.21020507812 0
150 2.778076171875 1848.47705078125 1848.47705078125 0
350 2.796630859375 4031.19921875 4031.19921875 0
2 2.85546875 25.697509765625 25.697509765625 0
250 3.51171875 2921.6435546875 2921.6435546875 0
200 3.11474609375 2152.3798828125 2152.3798828125 0
3 2.737060546875 58.076904296875 58.076904296875 0
8000 3.200927734375 101148.99072265625 101148.99072265625 0
150 2.488037109375 1788.879638671875 1788.879638671875 0
2000 3.116943359375 24448.102294921875 24448.102294921875 0
150 2.490966796875 1774.4873046875 1774.4873046875 0
25 3.10546875 266.85107421875 266.85107421875 0
150 2.681396484375 1860.23876953125 1860.23876953125 0
2 3.12353515625 35.093505859375 35.093505859375 0
15 3.143310546875 202.46044921875 202.46044921875 0
2000 3.238525390625 22797.824951171875 22797.824951171875 0
500 3.24365234375 5651.39453125 5651.39453125 0
1 3.165283203125 43.209716796875 43.209716796875 0
350 3.292724609375 3977.621337890625 3978.621337890625 0
350 3.131591796875 4375.62353515625 4375.62353515625 0
30 2.4501953125 538.27392578125 538.27392578125 0
40 2.858642578125 590.14501953125 590.14501953125 0
700 3.492431640625 8464.315673828125 8464.315673828125 0
200 2.548583984375 2451.807373046875 2451.807373046875 0
2 2.983154296875 52.92333984375 52.92333984375 0
5 3.16064453125 38.17431640625 38.17431640625 0
40 2.796630859375 468.790283203125 468.790283203125 0
200 4.87451171875 2409.447021484375 2409.447021484375 0
15 3.050048828125 175.539306640625 175.539306640625 0
700 2.652099609375 8178.508544921875 8178.508544921875 0
2 5.343505859375 89.43701171875 89.43701171875 0
700 3.469970703125 8149.694091796875 8149.694091796875 0
200 2.239013671875 2419.325439453125 2419.325439453125 0
40 5.36083984375 468.732421875 468.732421875 0
40 2.78466796875 772.406982421875 772.406982421875 0
150 3.287353515625 1946.161376953125 1946.161376953125 0
1000 2.592041015625 12264.8427734375 12264.8427734375 0
200 3.3095703125 2344.987060546875 2345.987060546875 0
100 3.3291015625 1005.63330078125 1006.63330078125 0
2000 2.802978515625 24038.73583984375 24038.73583984375 0
8000 3.77587890625 95429.49633789062 95429.49633789062 0
15 4.8349609375 200.134033203125 200.134033203125 0
3 4.890625 76.7451171875 76.7451171875 0
40 2.326171875 339.775634765625 339.775634765625 0
15 3.060302734375 166.898681640625 166.898681640625 0
100 2.887939453125 1377.70947265625 1377.70947265625 0
2000 2.655517578125 24315.61962890625 24315.61962890625 0
25 2.993896484375 255.83203125 255.83203125 0
40 4.478759765625 351.8486328125 351.8486328125 0
1000 4.71044921875 12029.572509765625 12029.572509765625 0
200 2.52685546875 2427.031494140625 2427.031494140625 0
30 3.20166015625 277.758056640625 277.758056640625 0
200 2.7509765625 2447.2109375 2447.2109375 0
15 3.107666015625 149.5185546875 149.5185546875 0
500 3.010009765625 6171.472900390625 6171.472900390625 0
4000 2.71728515625 46650.008056640625 46650.008056640625 0
500 4.60205078125 6311.959228515625 6311.959228515625 0
700 2.740478515625 7919.444580078125 7919.444580078125 0
1000 3.142578125 11766.9580078125 11766.9580078125 0
2000 2.94775390625 23007.89990234375 23007.89990234375 0
2 2.8681640625 66.76611328125 66.76611328125 0
350 3.29443359375 4274.416748046875 4274.416748046875 0
8000 4.76513671875 95685.060546875 95685.060546875 0
8000 4.993896484375 94167.37573242188 94167.37573242188 0
500 5.78173828125 5705.327880859375 5705.327880859375 0
100 2.342529296875 876.042724609375 876.042724609375 0
50 2.69873046875 429.929931640625 429.929931640625 0
30 3.177001953125 419.807373046875 419.807373046875 0
4000 2.494384765625 47183.5087890625 47183.5087890625 0
100 2.880126953125 1478.90771484375 1478.90771484375 0
350 2.52685546875 4076.692626953125 4076.692626953125 0
50 2.79345703125 428.9052734375 428.9052734375 0
2000 2.972412109375 22676.217529296875 22676.217529296875 0
1000 3.0341796875 11959.22900390625 11959.22900390625 0
200 4.375 2481.966796875 2482.966796875 0
2 3.165283203125 91.95068359375 91.95068359375 0
4000 2.34033203125 45972.444091796875 45972.444091796875 0
1 5.008056640625 73.40966796875 73.40966796875 0
2 2.966796875 11.8857421875 11.8857421875 0
100 4.151611328125 1004.10791015625 1004.10791015625 0
15 5.80810546875 402.2919921875 402.2919921875 0
50 4.43603515625 929.588623046875 929.588623046875 0
50 2.98388671875 693.429443359375 693.429443359375 0
100 3.1796875 1332.75537109375 1332.75537109375 0
25 2.455322265625 228.59033203125 228.59033203125 0
250 2.95263671875 2861.834716796875 2861.834716796875 0
8000 3.2548828125 92346.5205078125 92346.5205078125 0
250 2.882568359375 2962.709228515625 2962.709228515625 0
150 3.165283203125 1885.104248046875 1885.104248046875 0
2000 2.62548828125 22784.960693359375 22784.960693359375 0
1 4.82373046875 21.479248046875 21.479248046875 0
250 2.690673828125 3273.60986328125 3273.60986328125 0
5 2.43701171875 69.22216796875 69.22216796875 0
8000 5.364501953125 93077.92626953125 93077.92626953125 0
1 4.93212890625 15.4560546875 15.4560546875 0
100 2.7109375 1558.05712890625 1558.05712890625 0
1 4.992919921875 40.144775390625 40.144775390625 0
1000 4.098388671875 11804.23779296875 11804.23779296875 0
250 2.50146484375 2822.625244140625 2822.625244140625 0
3 3.538330078125 53.26123046875 53.26123046875 0
25 2.389404296875 230.190185546875 230.190185546875 0
40 2.79296875 377.299560546875 377.299560546875 0
700 2.845458984375 8071.093505859375 8071.093505859375 0
2 2.89697265625 90.982421875 90.982421875 0
2000 5.591552734375 24015.787353515625 24015.787353515625 0
2 3.930908203125 49.31396484375 49.31396484375 0
150 3.449462890625 1873.271728515625 1873.271728515625 0
250 2.920654296875 3103.23486328125 3103.23486328125 0
350 2.96875 4369.7177734375 4369.7177734375 0
40 2.562744140625 400.5771484375 400.5771484375 0
2 3.50537109375 31.798583984375 31.798583984375 0
2000 2.622314453125 23363.77099609375 23363.77099609375 0
8000 2.964599609375 93427.24926757812 93427.24926757812 0
2000 2.9140625 23295.07470703125 23295.07470703125 0
25 2.85546875 289.427001953125 289.427001953125 0
700 2.980712890625 8309.453857421875 8309.453857421875 0
8000 3.133056640625 92393.0615234375 92393.0615234375 0
700 5.789794921875 8508.09375 8508.09375 0
3 3.14501953125 12.2333984375 12.2333984375 0
3 3.067138671875 81.81689453125 81.81689453125 0
700 3.450927734375 8236.79296875 8236.79296875 0
2 3.177734375 65.46484375 65.46484375 0
100 3.498291015625 1407.39501953125 1407.39501953125 0
700 2.914306640625 8171.733642578125 8171.733642578125 0
25 4.03759765625 298.002197265625 299.002197265625 0
50 5.412841796875 507.974853515625 507.974853515625 0
4000 2.49951171875 46919.32421875 46919.32421875 0
15 2.75634765625 149.05126953125 149.05126953125 0
500 3.068115234375 6012.879150390625 6012.879150390625 0
30 3.250244140625 253.11572265625 253.11572265625 0
200 4.94189453125 2412.510009765625 2413.510009765625 0
2 2.818359375 59.960693359375 59.960693359375 0
200 3.179443359375 2314.927978515625 2314.927978515625 0
250 2.479248046875 2843.341552734375 2843.341552734375 0
500 2.742431640625 6074.314453125 6074.314453125 0
40 2.743896484375 366.43701171875 366.43701171875 0
1000 2.7900390625 11316.590087890625 11316.590087890625 0
3 2.68359375 80.0654296875 80.0654296875 0
500 2.533935546875 5700.295166015625 5700.295166015625 0
15 3.032958984375 204.056396484375 204.056396484375 0
2000 3.045166015625 23145.043701171875 23145.043701171875 0
150 3.012451171875 1929.271240234375 1929.271240234375 0
50 3.0087890625 839.103759765625 839.103759765625 0
1 2.634765625 62.1748046875 62.1748046875 0
150 3.3115234375 1988.747802734375 1988.747802734375 0
30 2.804443359375 311.022216796875 311.022216796875 0
250 3.068115234375 2910.191162109375 2910.191162109375 0
8000 3.107421875 92632.18701171875 92632.18701171875 0
1000 2.59619140625 12031.59765625 12031.59765625 0
15 3.371337890625 174.077880859375 175.077880859375 0
5 2.82470703125 98.9306640625 98.9306640625 0
3 2.77783203125 32.08935546875 32.08935546875 0
25 4.101318359375 329.475341796875 329.475341796875 0
500 2.8916015625 6224.177490234375 6224.177490234375 0
5 4.852294921875 128.51708984375 128.51708984375 0
3 3.05908203125 74.2265625 74.2265625 0
1000 3.370361328125 12007.037353515625 12007.037353515625 0
150 2.835205078125 1764.923828125 1764.923828125 0
2000 3.016357421875 23186.244384765625 23186.244384765625 0
4000 2.8740234375 47319.98291015625 47319.98291015625 0
150 2.798828125 1979.888671875 1979.888671875 0
1000 2.809814453125 11902.23828125 11902.23828125 0
40 2.900634765625 375.644775390625 375.644775390625 0
350 3.46142578125 3985.705078125 3985.705078125 0
700 2.6591796875 8251.36181640625 8251.36181640625 0
2 3.922119140625 38.934814453125 38.934814453125 0
25 2.275634765625 558.915771484375 558.915771484375 0
1 3.1689453125 194.95751953125 194.95751953125 0
500 2.94921875 5769.556396484375 5769.556396484375 0
150 2.91943359375 1580.028076171875 1580.028076171875 0
250 3.3359375 3090.69189453125 3090.69189453125 0
40 3.212158203125 854.77880859375 854.77880859375 0
50 6.95849609375 812.23193359375 813.23193359375 0
8000 3.61474609375 94132.57250976562 94132.57250976562 0
100 2.572509765625 1002.157958984375 1002.157958984375 0
50 3.144775390625 675.205078125 675.205078125 0
500 2.51513671875 5899.444091796875 5899.444091796875 0
2000 4.223876953125 24173.0966796875 24173.0966796875 0
250 3.232421875 3183.1025390625 3183.1025390625 0
40 2.783447265625 675.69775390625 675.69775390625 0
200 2.622802734375 2508.348876953125 2508.348876953125 0
700 2.760009765625 8436.876708984375 8436.876708984375 0
1000 5.340087890625 12297.162353515625 12297.162353515625 0
350 3.24560546875 3805.391357421875 3805.391357421875 0
30 3.66796875 580.3759765625 580.3759765625 0
2 2.43017578125 19.1669921875 19.1669921875 0
200 2.9619140625 2562.591796875 2562.591796875 0
500 3.135009765625 5916.560302734375 5916.560302734375 0
100 2.796142578125 1498.3408203125 1498.3408203125 0
4000 3.377685546875 47242.953369140625 47242.953369140625 0
5 2.487548828125 32.193115234375 32.193115234375 0
700 3.309326171875 8043.6357421875 8043.6357421875 0
30 3.2529296875 306.385009765625 306.385009765625 0
700 4.603271484375 8321.671630859375 8321.671630859375 0
150 3.388427734375 1998.689697265625 1998.689697265625 0
700 3.26025390625 8264.231201171875 8264.231201171875 0
8000 3.478759765625 93270.65698242188 93271.65698242188 0
2 2.30615234375 29.447265625 29.447265625 0
150 3.308349609375 1902.995849609375 1902.995849609375 0
350 5.333740234375 4586.94970703125 4586.94970703125 0
8000 3.28857421875 94325.17016601562 94325.17016601562 0
100 3.1904296875 1499.182861328125 1499.182861328125 0
500 3.388427734375 6481.12841796875 6481.12841796875 0
700 3.20654296875 8395.190185546875 8395.190185546875 0
350 2.997314453125 3985.94677734375 3985.94677734375 0
2 3.025146484375 11.88232421875 11.88232421875 0
700 3.310791015625 8444.140625 8444.140625 0
100 2.805908203125 1112.490966796875 1112.490966796875 0
25 3.107421875 564.55126953125 564.55126953125 0
350 3.562255859375 4071.571044921875 4072.571044921875 0
250 2.982666015625 3396.0859375 3396.0859375 0
700 2.4921875 8559.69580078125 8559.69580078125 0
50 2.688720703125 670.710693359375 670.710693359375 0
15 2.43359375 113.70166015625 113.70166015625 0
15 3.024169921875 194.427978515625 194.427978515625 0
5 2.987548828125 68.039306640625 68.039306640625 0
1000 2.94677734375 12067.39599609375 12067.39599609375 0
1 2.725830078125 8.308837890625 8.308837890625 0
50 2.6484375 440.765625 440.765625 0
100 2.999755859375 960.828369140625 960.828369140625 0
50 2.85986328125 923.9619140625 923.9619140625 0
2 2.58349609375 58.533447265625 58.533447265625 0
150 3.210205078125 1675.5791015625 1676.5791015625 0
350 3.166259765625 4176.274658203125 4176.274658203125 0
15 2.9228515625 216.014892578125 216.014892578125 0
15 3.6162109375 199.989501953125 199.989501953125 0
2 2.771240234375 83.75634765625 83.75634765625 0
350 2.730712890625 4230.135986328125 4230.135986328125 0
150 4.15869140625 1906.969970703125 1906.969970703125 0
700 2.494140625 8183.000732421875 8183.000732421875 0
3 3.37548828125 38.12060546875 38.12060546875 0
1000 2.29150390625 11776.54443359375 11776.54443359375 0
1000 3.2109375 11362.018310546875 11362.018310546875 0
1 2.9296875 35.399169921875 35.399169921875 0
2 3.11279296875 147.5361328125 147.5361328125 0
200 2.45751953125 2446.607666015625 2446.607666015625 0
500 3.264892578125 5771.7275390625 5771.7275390625 0
5 4.44775390625 73.9892578125 73.9892578125 0
150 2.591064453125 1936.35595703125 1936.35595703125 0
350 2.811279296875 4256.548583984375 4256.548583984375 0
2000 3.45166015625 23474.0068359375 23474.0068359375 0
15 2.551513671875 114.497314453125 114.497314453125 0
5 3.225341796875 192.48583984375 192.48583984375 0
30 3.9013671875 698.116455078125 698.116455078125 0
200 3.091064453125 2400.3701171875 2400.3701171875 0
50 3.20166015625 506.030517578125 506.030517578125 0
1000 4.486083984375 11392.014892578125 11392.014892578125 0
2 4.884033203125 103.3935546875 103.3935546875 0
8000 2.89453125 94760.537109375 94760.537109375 0
30 3.45361328125 368.508544921875 368.508544921875 0
1 3.554931640625 23.6826171875 23.6826171875 0
1000 3.437744140625 11289.5712890625 11289.5712890625 0
3 2.96533203125 60.170654296875 60.170654296875 0
1 2.46142578125 43.28955078125 43.28955078125 0
150 2.760986328125 1791.915771484375 1791.915771484375 0
250 3.1982421875 2907.998046875 2908.998046875 0
1000 3.2939453125 11990.903564453125 11990.903564453125 0
25 5.1455078125 368.1943359375 369.1943359375 0
25 3.17919921875 256.286376953125 256.286376953125 0
40 2.999267578125 316.281982421875 316.281982421875 0
50 3.419189453125 969.377685546875 969.377685546875 0
2 2.537109375 71.97314453125 71.97314453125 0
50 3.611328125 587.334716796875 587.334716796875 0
2000 2.897216796875 23948.1083984375 23948.1083984375 0
2 2.876953125 35.36669921875 35.36669921875 0
40 2.39892578125 589.302978515625 589.302978515625 0
50 3.249267578125 774.51708984375 774.51708984375 0
1000 3.761474609375 12078.1552734375 12078.1552734375 0
2000 2.976318359375 23231.16455078125 23231.16455078125 0
200 3.176513671875 2589.73876953125 2589.73876953125 0
1000 2.636474609375 11870.989990234375 11870.989990234375 0
3 2.826416015625 64.807861328125 64.807861328125 0
200 2.80029296875 2181.32421875 2181.32421875 0
8000 3.43798828125 94497.00024414062 94497.00024414062 0
30 4.803466796875 477.12890625 477.12890625 0
30 4.580810546875 310.6904296875 310.6904296875 0
200 2.4521484375 2481.79736328125 2481.79736328125 0
8000 2.628662109375 93982.27001953125 93982.27001953125 0
40 3.130859375 464.120361328125 464.120361328125 0
1000 4.39404296875 12241.753662109375 12241.753662109375 0
2000 3.309326171875 24712.278076171875 24712.278076171875 0
100 3.34619140625 1000.554931640625 1000.554931640625 0
3 2.4306640625 80.681396484375 80.681396484375 0
8000 5.044677734375 94449.38305664062 94450.38305664062 0
1000 5.079345703125 12118.697509765625 12118.697509765625 0
2 5.02734375 80.361083984375 80.361083984375 0
2 4.656005859375 13.419677734375 13.419677734375 0
700 2.89990234375 8583.529296875 8583.529296875 0
200 2.893310546875 2640.435791015625 2640.435791015625 0
1000 3.199462890625 12806.467529296875 12806.467529296875 0
150 3.082763671875 2137.771728515625 2137.771728515625 0
30 4.62109375 383.89453125 383.89453125 0
8000 3.0908203125 96174.27856445312 96174.27856445312 0
25 2.984130859375 278.86865234375 278.86865234375 0
3 5.673095703125 97.903564453125 97.903564453125 0
40 4.48291015625 722.690673828125 722.690673828125 0
250 4.23583984375 3188.44970703125 3188.44970703125 0
25 4.349609375 325.287109375 325.287109375 0
40 2.59033203125 415.9150390625 415.9150390625 0
15 2.36572265625 190.97509765625 190.97509765625 0
3 5.67236328125 16.775634765625 16.775634765625 0
250 2.5087890625 2956.416015625 2956.416015625 0
25 5.10009765625 559.22900390625 559.22900390625 0
2 4.526611328125 34.238037109375 34.238037109375 0
40 3.211669921875 444.876220703125 444.876220703125 0
4000 3.312255859375 48053.04638671875 48053.04638671875 0
150 3.314697265625 1988.676513671875 1989.676513671875 0
8000 2.447021484375 95631.7099609375 95631.7099609375 0
1000 5.23486328125 12342.052001953125 12342.052001953125 0
8000 2.923828125 95930.59326171875 95930.59326171875 0
25 5.7841796875 605.260009765625 605.260009765625 0
350 4.6943359375 4524.6904296875 4524.6904296875 0
4000 2.601318359375 48828.0126953125 48828.0126953125 0
40 2.72998046875 576.9814453125 576.9814453125 0
5 3.19482421875 77.12158203125 77.12158203125 0
50 2.957275390625 575.869140625 575.869140625 0
500 2.287109375 5838.87109375 5838.87109375 0
50 2.917724609375 481.97216796875 481.97216796875 0
200 3.159423828125 2231.82763671875 2231.82763671875 0
50 2.29833984375 633.4365234375 633.4365234375 0
40 2.900146484375 786.6748046875 786.6748046875 0
8000 2.943115234375 94899.90698242188 94899.90698242188 0
8000 2.639892578125 94979.96655273438 94979.96655273438 0
2 2.8876953125 93.7744140625 93.7744140625 0
5 3.259521484375 98.10791015625 98.10791015625 0
100 3.040771484375 1273.34033203125 1273.34033203125 0
3 2.726318359375 34.203857421875 34.203857421875 0
100 2.49462890625 1072.5361328125 1072.5361328125 0
100 2.5595703125 1111.544921875 1111.544921875 0
100 2.959228515625 1477.126953125 1477.126953125 0
100 2.970458984375 1424.479248046875 1424.479248046875 0
40 2.713134765625 462.21875 462.21875 0
150 2.900390625 1779.8330078125 1779.8330078125 0
250 3.278076171875 2907.51123046875 2908.51123046875 0
200 3.32421875 2070.48486328125 2070.48486328125 0
500 2.750732421875 6992.573486328125 6992.573486328125 0
700 2.985595703125 9380.77490234375 9380.77490234375 0
1 5.06591796875 83.757080078125 83.757080078125 0
350 3.262939453125 6899.327392578125 6899.327392578125 0
150 3.713134765625 3227.625 3227.625 0
4000 2.87060546875 51296.95849609375 51296.95849609375 0
2000 3.20263671875 26570.065185546875 26570.065185546875 0
15 3.44775390625 377.089111328125 377.089111328125 0
200 3.123291015625 2569.9501953125 2569.9501953125 0
2 5.053955078125 17.783935546875 17.783935546875 0
2000 3.165771484375 26907.065673828125 26907.065673828125 0
350 2.673095703125 4501.469970703125 4501.469970703125 0
40 4.495849609375 476.654296875 476.654296875 0
1 3.25048828125 71.1611328125 71.1611328125 0
1000 3.4765625 15152.298095703125 15152.298095703125 0
1000 2.779052734375 14904.666748046875 14904.666748046875 0
3 3.1484375 89.557861328125 89.557861328125 0
1000 2.257080078125 14689.35009765625 14689.35009765625 0
50 3.2685546875 960.1337890625 960.1337890625 0
200 2.689208984375 2394.017333984375 2394.017333984375 0
5 4.211669921875 102.518310546875 102.518310546875 0
25 2.36767578125 282.459228515625 282.459228515625 0
30 3.348876953125 504.161376953125 504.161376953125 0
1000 2.247802734375 12267.6044921875 12267.6044921875 0
40 2.8720703125 600.56689453125 600.56689453125 0
1000 2.5419921875 12066.821533203125 12066.821533203125 0
2 2.31396484375 16.049560546875 16.049560546875 0
4000 3.259765625 51772.47900390625 51772.47900390625 0
3 2.728271484375 96.197021484375 96.197021484375 0
30 3.355224609375 262.32373046875 262.32373046875 0
40 3.037841796875 334.06005859375 334.06005859375 0
200 2.3701171875 2012.9189453125 2012.9189453125 0
1000 3.630126953125 11763.58544921875 11763.58544921875 0
500 3.32568359375 6113.817626953125 6113.817626953125 0
100 2.756103515625 1505.285888671875 1505.285888671875 0
700 5.0302734375 8795.19970703125 8795.19970703125 0
200 2.625732421875 2393.784423828125 2393.784423828125 0
8000 2.870361328125 99977.90380859375 99977.90380859375 0
3 2.683349609375 11.94287109375 11.94287109375 0
5 3.110595703125 93.7880859375 93.7880859375 0
700 2.92041015625 8182.358154296875 8182.358154296875 0
5 2.884521484375 53.64404296875 53.64404296875 0
100 2.370849609375 1420.162841796875 1420.162841796875 0
8000 3.46435546875 99623.29174804688 99623.29174804688 0
8000 2.6435546875 100040.40747070312 100040.40747070312 0
100 3.35693359375 1440.2353515625 1440.2353515625 0
50 3.397705078125 580.26953125 580.26953125 0
500 3.38720703125 6472.81201171875 6472.81201171875 0
1000 3.12890625 11606.90185546875 11606.90185546875 0
8000 2.90771484375 99423.31982421875 99423.31982421875 0
1 2.785400390625 66.85595703125 66.85595703125 0
30 2.501708984375 315.496826171875 315.496826171875 0
30 3.602783203125 309.387939453125 309.387939453125 0
15 2.746337890625 168.430908203125 168.430908203125 0
1000 3.410888671875 12056.79150390625 12056.79150390625 0
2 2.908447265625 64.71240234375 64.71240234375 0
1000 3.0634765625 11881.65576171875 11881.65576171875 0
40 2.677978515625 403.829345703125 403.829345703125 0
500 3.21923828125 6159.59423828125 6159.59423828125 0
1000 4.4658203125 12080.72900390625 12080.72900390625 0
4000 3.00537109375 51559.02294921875 51559.02294921875 0
350 3.04248046875 4129.392333984375 4129.392333984375 0
1000 2.951171875 11680.656494140625 11680.656494140625 0
700 3.16845703125 8039.285888671875 8039.285888671875 0
500 5.970947265625 5845.66845703125 5845.66845703125 0
15 5.121826171875 290.1376953125 290.1376953125 0
4000 3.293212890625 49570.873046875 49570.873046875 0
500 3.3359375 5623.571533203125 5624.571533203125 0
250 3.0029296875 3288.6982421875 3288.6982421875 0
700 3.146240234375 8037.41943359375 8037.41943359375 0
1 2.956298828125 62.192626953125 62.192626953125 0
150 2.84765625 1793.395751953125 1793.395751953125 0
100 3.16748046875 972.16943359375 972.16943359375 0
500 3.218505859375 5745.826904296875 5745.826904296875 0
3 3.314208984375 82.18212890625 82.18212890625 0
40 2.921142578125 842.5947265625 842.5947265625 0
5 3.04248046875 44.619873046875 44.619873046875 0
8000 4.621826171875 99614.51196289062 99614.51196289062 0
250 3.22216796875 2875.794677734375 2875.794677734375 0
150 2.50537109375 1972.53564453125 1972.53564453125 0
200 4.317138671875 2481.9267578125 2481.9267578125 0
4000 3.255859375 47636.691650390625 47636.691650390625 0
4000 2.882080078125 47395.593994140625 47395.593994140625 0
150 2.40869140625 1979.49853515625 1979.49853515625 0
5 3.212890625 21.300537109375 21.300537109375 0
40 3.355712890625 378.11376953125 378.11376953125 0
25 3.21923828125 216.255126953125 216.255126953125 0
1 2.762451171875 91.254638671875 91.254638671875 0
5 3.124267578125 81.638427734375 81.638427734375 0
1 2.57373046875 49.443115234375 49.443115234375 0
200 3.494873046875 2275.696044921875 2275.696044921875 0
700 3.1455078125 8745.158447265625 8745.158447265625 0
5 2.75537109375 104.502197265625 104.502197265625 0
2 2.787109375 10.692138671875 10.692138671875 0
25 4.925537109375 291.98095703125 291.98095703125 0
40 2.280029296875 481.275390625 481.275390625 0
4000 2.960205078125 47209.610595703125 47209.610595703125 0
50 2.399658203125 507.875244140625 507.875244140625 0
2 3.025634765625 90.26806640625 90.26806640625 0
100 2.79345703125 1134.557373046875 1134.557373046875 0
30 2.94091796875 566.736328125 566.736328125 0
4000 2.648193359375 47280.47509765625 47280.47509765625 0
50 2.763671875 609.165771484375 609.165771484375 0
350 2.647216796875 4175.11474609375 4175.11474609375 0
3 2.512451171875 51.167236328125 51.167236328125 0
200 5.123291015625 2378.313720703125 2378.313720703125 0
100 2.72705078125 1477.24560546875 1477.24560546875 0
500 3.026123046875 5316.766357421875 5316.766357421875 0
5 2.932373046875 91.59619140625 91.59619140625 0
1000 2.927490234375 11851.524169921875 11851.524169921875 0
40 2.863525390625 408.94140625 408.94140625 0
150 6.501953125 1797.507568359375 1797.507568359375 0
15 2.302734375 287.830810546875 287.830810546875 0
30 2.982421875 381.229248046875 381.229248046875 0
50 3.22265625 455.203369140625 455.203369140625 0
2000 3.29833984375 24285.763671875 24285.763671875 0
500 2.897705078125 5674.388427734375 5674.388427734375 0
500 3.45068359375 6071.04052734375 6071.04052734375 0
50 3.2919921875 557.145263671875 557.145263671875 0
100 3.093505859375 1456.198974609375 1456.198974609375 0
4000 3.81689453125 48051.3681640625 48051.3681640625 0
30 3.17041015625 472.28955078125 472.28955078125 0
100 3.353515625 1234.97900390625 1234.97900390625 0
40 3.59716796875 585.9482421875 585.9482421875 0
1 3.013671875 8.989501953125 8.989501953125 0
3 2.310302734375 87.504150390625 87.504150390625 0
200 2.472412109375 2375.6708984375 2375.6708984375 0
1000 2.917236328125 11067.18408203125 11067.18408203125 0
30 3.723388671875 491.067626953125 492.067626953125 0
4000 3.11865234375 46568.91455078125 46568.91455078125 0
40 3.05078125 452.54541015625 452.54541015625 0
2000 2.91455078125 22403.522705078125 22403.522705078125 0
1 3.56201171875 89.9404296875 90.9404296875 0
30 2.4541015625 219.07666015625 219.07666015625 0
500 3.289306640625 5445.613037109375 5445.613037109375 0
2 3.133056640625 75.831298828125 75.831298828125 0
4000 5.5625 46578.81982421875 46578.81982421875 0
3 3.28564453125 46.594970703125 46.594970703125 0
15 4.60009765625 140.151611328125 140.151611328125 0
30 2.35986328125 214.157958984375 214.157958984375 0
40 2.734130859375 769.151611328125 769.151611328125 0
100 3.63671875 1430.29833984375 1430.29833984375 0
1 2.842529296875 50.92626953125 50.92626953125 0
100 4.076904296875 988.40966796875 988.40966796875 0
500 3.37939453125 5264.16162109375 5264.16162109375 0
200 2.949462890625 2185.367431640625 2185.367431640625 0
40 6.0673828125 847.029052734375 847.029052734375 0
30 3.158203125 409.47412109375 409.47412109375 0
25 3.430419921875 370.209228515625 370.209228515625 0
2 2.896728515625 81.0703125 81.0703125 0
2 3.26318359375 87.88037109375 87.88037109375 0
1 2.471923828125 18.81201171875 18.81201171875 0
250 4.734375 2698.31689453125 2698.31689453125 0
3 2.821044921875 94.39697265625 94.39697265625 0
3 3.494873046875 93.2578125 93.2578125 0
4000 2.9013671875 45279.158203125 45279.158203125 0
100 5.00830078125 1273.5107421875 1273.5107421875 0
200 2.809326171875 2313.45458984375 2313.45458984375 0
250 2.742919921875 3024.877197265625 3024.877197265625 0
5 3.1845703125 106.31396484375 106.31396484375 0
150 3.143798828125 1473.027587890625 1473.027587890625 0
150 2.919189453125 1374.02783203125 1374.02783203125 0
25 2.363525390625 249.56103515625 249.56103515625 0
40 4.040283203125 776.118408203125 776.118408203125 0
2 2.697509765625 43.599853515625 43.599853515625 0
150 2.4931640625 1875.80322265625 1875.80322265625 0
5 2.870849609375 75.337646484375 75.337646484375 0
50 2.524658203125 502.2119140625 502.2119140625 0
30 3.15234375 297.9501953125 297.9501953125 0
4000 3.177734375 43921.762451171875 43921.762451171875 0
30 2.76904296875 286.34765625 286.34765625 0
8000 2.684814453125 93617.48974609375 93617.48974609375 0
700 4.80224609375 7818.991943359375 7818.991943359375 0
40 2.552734375 698.0400390625 698.0400390625 0
1 3.17626953125 69.4130859375 69.4130859375 0
2000 2.44384765625 21791.760986328125 21791.760986328125 0
2000 3.115966796875 21242.64404296875 21242.64404296875 0
350 3.0625 3817.1181640625 3817.1181640625 0
8000 3.031494140625 92800.45825195312 92800.45825195312 0
2 2.7568359375 75.32861328125 75.32861328125 0
200 3.12255859375 2160.74755859375 2160.74755859375 0
3 3.284912109375 52.87890625 52.87890625 0
350 4.989501953125 3764.572509765625 3764.572509765625 0
1 3.00146484375 10.090087890625 10.090087890625 0
500 2.28515625 5162.15185546875 5162.15185546875 0
40 3.180419921875 758.263671875 758.263671875 0
250 3.84375 2893.71337890625 2893.71337890625 0
50 3.238037109375 609.794921875 609.794921875 0
4000 2.983642578125 44235.74169921875 44235.74169921875 0
500 3.52880859375 5368.483642578125 5368.483642578125 0
2000 3.21533203125 21892.519775390625 21892.519775390625 0
50 3.277587890625 474.649169921875 474.649169921875 0
15 3.30859375 162.3798828125 162.3798828125 0
15 4.4775390625 239.982177734375 239.982177734375 0
500 2.986083984375 5468.71875 5468.71875 0
250 2.675537109375 2653.17041015625 2653.17041015625 0
200 2.692138671875 2265.52734375 2265.52734375 0
1000 3.178466796875 10512.271484375 10512.271484375 0
8000 3.038818359375 105259.07080078125 105259.07080078125 0
350 2.397216796875 3855.498046875 3855.498046875 0
4000 4.864013671875 43734.258544921875 43734.258544921875 0
50 2.87939453125 965.635498046875 965.635498046875 0
5 2.296875 42.00537109375 42.00537109375 0
4000 3.35986328125 59167.087646484375 59167.087646484375 0
150 2.69482421875 1452.529296875 1452.529296875 0
1 5.119140625 74.675048828125 74.675048828125 0
200 2.841064453125 2365.28759765625 2365.28759765625 0
50 3.089599609375 850.98388671875 850.98388671875 0
1000 3.063232421875 11267.7529296875 11267.7529296875 0
50 3.26123046875 530.57958984375 530.57958984375 0
350 3.20556640625 4175.515625 4175.515625 0
1000 2.371337890625 10745.538818359375 10745.538818359375 0
40 3.11669921875 451.6904296875 451.6904296875 0
700 3.033935546875 7976.539794921875 7976.539794921875 0
25 2.464111328125 212.493896484375 212.493896484375 0
250 3.51513671875 2840.056396484375 2841.056396484375 0
350 2.989013671875 3736.049072265625 3736.049072265625 0
1 2.73876953125 80.93017578125 80.93017578125 0
150 3.35693359375 1940.037109375 1940.037109375 0
500 2.732177734375 5744.673095703125 5744.673095703125 0
200 3.295654296875 2284.73974609375 2284.73974609375 0
4000 3.677001953125 44876.60302734375 44876.60302734375 0
15 2.265869140625 309.536376953125 309.536376953125 0
40 3.19287109375 504.56787109375 504.56787109375 0
150 2.692138671875 1979.18798828125 1979.18798828125 0
3 2.584716796875 16.034423828125 16.034423828125 0
1000 2.674072265625 11791.7373046875 11791.7373046875 0
350 3.139404296875 4249.155029296875 4249.155029296875 0
3 2.95751953125 96.220947265625 96.220947265625 0
5 3.288818359375 99.635986328125 99.635986328125 0
50 2.67333984375 578.185302734375 578.185302734375 0
500 4.15625 5778.54736328125 5779.54736328125 0
2 2.485595703125 76.774658203125 76.774658203125 0
1 2.37060546875 85.412841796875 85.412841796875 0
1 3.025634765625 21.019775390625 21.019775390625 0
1000 3.498779296875 11554.603515625 11554.603515625 0
50 2.96826171875 784.43505859375 784.43505859375 0
2000 4.667236328125 32071.591064453125 32071.591064453125 0
8000 2.821533203125 89454.90380859375 89454.90380859375 0
3 2.69677734375 10.912841796875 10.912841796875 0
5 2.960205078125 82.553955078125 82.553955078125 0
200 2.415771484375 2351.1123046875 2351.1123046875 0
500 3.318115234375 5580.669921875 5580.669921875 0
350 3.21435546875 3970.645751953125 3970.645751953125 0
25 3.142333984375 227.3759765625 227.3759765625 0
500 2.693603515625 5502.5 5502.5 0
250 2.976318359375 3639.4267578125 3639.4267578125 0
4000 5.460205078125 62583.435546875 62583.435546875 0
1 3.09033203125 75.06103515625 75.06103515625 0
40 3.109130859375 643.151611328125 643.151611328125 0
30 3.083251953125 267.676025390625 267.676025390625 0
500 2.936767578125 5667.1630859375 5667.1630859375 0
3 2.8330078125 92.33642578125 92.33642578125 0
2000 3.2783203125 23332.649169921875 23332.649169921875 0
150 3.426513671875 1854.5859375 1854.5859375 0
30 2.9599609375 328.839599609375 328.839599609375 0
25 3.535888671875 263.59130859375 263.59130859375 0
1000 2.610595703125 11701.24169921875 11701.24169921875 0
1000 2.7607421875 11659.685302734375 11659.685302734375 0
2 4.64892578125 54.546875 54.546875 0
3 2.531494140625 64.48291015625 64.48291015625 0
30 4.038330078125 578.04931640625 578.04931640625 0
1 3.312255859375 91.248779296875 91.248779296875 0
1000 3.382080078125 11955.970703125 11955.970703125 0
50 2.8251953125 457.251953125 457.251953125 0
2 3.659912109375 72.25341796875 72.25341796875 0
3 4.53515625 78.532958984375 78.532958984375 0
700 2.424072265625 8573.549072265625 8573.549072265625 0
30 3.140380859375 371.305419921875 371.305419921875 0
2000 3.174560546875 23677.435791015625 23677.435791015625 0
25 4.417724609375 295.128173828125 295.128173828125 0
250 2.38818359375 3182.111328125 3182.111328125 0
8000 4.131591796875 110484.74169921875 110484.74169921875 0
150 3.956298828125 1557.95068359375 1558.95068359375 0
1 3.40380859375 75.107177734375 76.107177734375 0
4000 2.89892578125 46335.379638671875 46335.379638671875 0
350 2.575439453125 4249.45166015625 4249.45166015625 0
100 2.486572265625 930.357177734375 930.357177734375 0
4000 3.4052734375 47044.07763671875 47045.07763671875 0
350 3.05615234375 4254.83642578125 4254.83642578125 0
350 3.19970703125 4479.7216796875 4479.7216796875 0
4000 4.752197265625 50741.669677734375 50741.669677734375 0
500 2.550048828125 6192.64453125 6192.64453125 0
700 2.674072265625 8348.658935546875 8348.658935546875 0
40 3.03173828125 476.583984375 476.583984375 0
4000 2.38720703125 47371.640380859375 47371.640380859375 0
2000 2.53564453125 24361.759521484375 24361.759521484375 0
4000 2.48779296875 49109.438720703125 49109.438720703125 0
3 5.31591796875 55.953857421875 55.953857421875 0
50 4.84033203125 591.648193359375 591.648193359375 0
2000 3.074951171875 24079.908447265625 24079.908447265625 0
1000 4.952880859375 12186.14794921875 12186.14794921875 0
30 5.243408203125 332.238525390625 332.238525390625 0
2000 2.694091796875 23641.478759765625 23641.478759765625 0
100 2.983154296875 1013.190185546875 1013.190185546875 0
4000 3.442138671875 47719.28857421875 47719.28857421875 0
40 7.67138671875 792.626220703125 792.626220703125 0
1 2.625244140625 35.90625 35.90625 0
5 2.59619140625 41.583740234375 41.583740234375 0
15 2.660888671875 184.933349609375 184.933349609375 0
30 3.05908203125 368.109130859375 368.109130859375 0
50 2.53271484375 756.239501953125 756.239501953125 0
500 2.77001953125 6051.349853515625 6051.349853515625 0
250 4.43798828125 3273.14453125 3273.14453125 0
15 3.121826171875 136.041259765625 136.041259765625 0
100 3.24267578125 1115.574951171875 1115.574951171875 0
350 2.48193359375 4192.532958984375 4192.532958984375 0
2 2.973388671875 89.639892578125 89.639892578125 0
200 3.38916015625 2370.2890625 2370.2890625 0
25 2.37353515625 345.88916015625 345.88916015625 0
350 3.066162109375 3748.01123046875 3748.01123046875 0
25 2.891357421875 245.20849609375 245.20849609375 0
5 3.277587890625 152.8759765625 152.8759765625 0
250 4.70458984375 3140.421630859375 3140.421630859375 0
1000 4.726806640625 11678.0703125 11678.0703125 0
15 4.184326171875 208.581787109375 208.581787109375 0
200 3.038330078125 2558.19873046875 2558.19873046875 0
50 3.111083984375 806.0234375 806.0234375 0
4000 2.541259765625 47174.065673828125 47174.065673828125 0
100 2.523193359375 975.3515625 975.3515625 0
100 3.233642578125 970.983154296875 970.983154296875 0
50 3.38818359375 452.298583984375 452.298583984375 0
40 2.849365234375 828.64892578125 828.64892578125 0
150 2.484130859375 1681.5322265625 1681.5322265625 0
350 2.836669921875 4452.778076171875 4452.778076171875 0
40 2.7333984375 390.498779296875 390.498779296875 0
4000 3.07470703125 47679.829833984375 47679.829833984375 0
1 2.99169921875 47.289794921875 47.289794921875 0
15 4.750244140625 118.4052734375 118.4052734375 0
200 3.21533203125 2189.90478515625 2190.90478515625 0
15 3.279296875 267.04638671875 267.04638671875 0
30 3.112548828125 542.161376953125 542.161376953125 0
3 2.448486328125 12.692626953125 12.692626953125 0
3 3.042724609375 172.3916015625 172.3916015625 0
50 3.430908203125 882.57275390625 882.57275390625 0
40 2.885498046875 474.8095703125 474.8095703125 0
200 2.939208984375 2389.93994140625 2389.93994140625 0
50 2.9345703125 572.693603515625 572.693603515625 0
40 2.562255859375 484.93408203125 484.93408203125 0
15 3.141357421875 150.15869140625 150.15869140625 0
50 3.23388671875 572.175537109375 572.175537109375 0
8000 2.764892578125 95264.14038085938 95264.14038085938 0
2000 4.490966796875 23179.768310546875 23179.768310546875 0
1 2.869140625 68.39501953125 68.39501953125 0
2000 3.2900390625 24150.739013671875 24150.739013671875 0
8000 3.33544921875 94884.26489257812 94884.26489257812 0
350 2.62841796875 3966.831298828125 3966.831298828125 0
30 2.281005859375 644.28662109375 644.28662109375 0
250 3.178466796875 3287.790283203125 3287.790283203125 0
15 3.40966796875 146.656494140625 146.656494140625 0
2000 3.300537109375 23571.03466796875 23571.03466796875 0
50 3.799560546875 519.90478515625 520.90478515625 0
3 2.783935546875 66.8955078125 66.8955078125 0
50 2.478515625 582.081787109375 582.081787109375 0
100 3.007568359375 1579.43896484375 1579.43896484375 0
200 3.01513671875 2445.842529296875 2445.842529296875 0
5 3.01904296875 18.740966796875 18.740966796875 0
50 3.087646484375 568.7197265625 568.7197265625 0
8000 2.61083984375 97278.72705078125 97278.72705078125 0
30 3.615478515625 378.276123046875 378.276123046875 0
2 2.769287109375 79.61474609375 79.61474609375 0
15 3.110107421875 124.326171875 124.326171875 0
25 4.08740234375 278.589111328125 278.589111328125 0
5 5.124267578125 204.586669921875 204.586669921875 0
2000 2.478515625 23952.82421875 23952.82421875 0
100 2.989013671875 1371.9912109375 1371.9912109375 0
5 2.90625 19.772705078125 19.772705078125 0
700 3.180419921875 8373.699462890625 8373.699462890625 0
150 2.470703125 1477.7490234375 1477.7490234375 0
5 3.62744140625 51.089111328125 51.089111328125 0
3 2.592041015625 70.640869140625 70.640869140625 0
1000 3.06201171875 11580.81591796875 11580.81591796875 0
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   494.55ms  531.60ms   2.00s    85.77%
    Req/Sec     1.73      2.86    10.00     85.32%
  935 requests in 10.00m, 206.62KB read
  Socket errors: connect 0, read 0, write 0, timeout 422
Requests/sec:      1.56
Transfer/sec:     352.58B
Requests: 	userdata: 0x4179b648	 completed.